WSDL/OpenShipService/OpenShip_v15/CreateOpenShipment_WARNING_794907332267_OK.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v15="http://fedex.com/ws/openship/v15">
   <soapenv:Header/>
   <soapenv:Body>
      <v15:CreateOpenShipmentRequest>
        <v15:WebAuthenticationDetail>
            <v15:ParentCredential>
               <v15:Key>INPUT YOUR INFORMATION</v15:Key>
               <v15:Password>INPUT YOUR INFORMATION</v15:Password>
            </v15:ParentCredential>
            <v15:UserCredential>
               <v15:Key>INPUT YOUR INFORMATION</v15:Key>
               <v15:Password>INPUT YOUR INFORMATION</v15:Password>
            </v15:UserCredential>
         </v15:WebAuthenticationDetail>
         <v15:ClientDetail>
            <v15:AccountNumber>INPUT YOUR INFORMATION</v15:AccountNumber>
            <v15:MeterNumber>INPUT YOUR INFORMATION</v15:MeterNumber>
            <v15:Localization>
               <v15:LanguageCode>EN</v15:LanguageCode>
               <v15:LocaleCode>en</v15:LocaleCode>
            </v15:Localization>
         </v15:ClientDetail>
         <v15:TransactionDetail>
            <v15:CustomerTransactionId>CreateOpenShipmentRequest_v6</v15:CustomerTransactionId>
            <v15:Localization>
               <v15:LanguageCode>EN</v15:LanguageCode>
               <v15:LocaleCode>en</v15:LocaleCode>
            </v15:Localization>
         </v15:TransactionDetail>
         <v15:Version>
            <v15:ServiceId>ship</v15:ServiceId>
            <v15:Major>15</v15:Major>
            <v15:Intermediate>0</v15:Intermediate>
            <v15:Minor>0</v15:Minor>
         </v15:Version>
         <v15:Index>Key1249</v15:Index>
         <v15:RequestedShipment>
            <v15:ShipTimestamp>2017-11-21T09:30:47-05:00</v15:ShipTimestamp>
            <v15:DropoffType>REGULAR_PICKUP</v15:DropoffType>
            <v15:ServiceType>INTERNATIONAL_PRIORITY</v15:ServiceType>
            <v15:PackagingType>YOUR_PACKAGING</v15:PackagingType>
            <v15:TotalWeight>
               <v15:Units>LB</v15:Units>
               <v15:Value>150.00</v15:Value>
            </v15:TotalWeight>
            <v15:Shipper>
               <v15:AccountNumber>150067600</v15:AccountNumber>
               <v15:Contact>
                  <v15:PersonName>INPUT YOUR INFORMATION</v15:PersonName>
                  <v15:CompanyName>SYNTEL</v15:CompanyName>
                  <v15:PhoneNumber>INPUT YOUR INFORMATION</v15:PhoneNumber>
                  <v15:EMailAddress>SWAPNIL_GHADAGE@GMAIL.COM</v15:EMailAddress>
               </v15:Contact>
               <v15:Address>
                  <v15:StreetLines>INPUT YOUR INFORMATION</v15:StreetLines>
                  <v15:City>Memphis</v15:City>
                  <v15:StateOrProvinceCode>TN</v15:StateOrProvinceCode>
                  <v15:PostalCode>38017</v15:PostalCode>
                  <v15:CountryCode>US</v15:CountryCode>
               </v15:Address>
            </v15:Shipper>
            <v15:Recipient>
               <v15:AccountNumber>INPUT YOUR INFORMATION</v15:AccountNumber>
               <v15:Contact>
                  <v15:PersonName>INPUT YOUR INFORMATION</v15:PersonName>
                  <v15:CompanyName>INFOSYS</v15:CompanyName>
                  <v15:PhoneNumber>INPUT YOUR INFORMATION</v15:PhoneNumber>
                  <v15:EMailAddress>NILESH_JARAD@GMAIL.COM</v15:EMailAddress>
               </v15:Contact>
               <v15:Address>
                  <v15:StreetLines>INPUT YOUR INFORMATION</v15:StreetLines>
                  <v15:City>Richmond</v15:City>
                  <v15:StateOrProvinceCode>BC</v15:StateOrProvinceCode>
                  <v15:PostalCode>v15C4v5</v15:PostalCode>
                  <v15:CountryCode>CA</v15:CountryCode>
               </v15:Address>
            </v15:Recipient>
            <v15:ShippingChargesPayment>
               <v15:PaymentType>SENDER</v15:PaymentType>
               <v15:Payor>
                  <v15:ResponsibleParty>
                     <v15:AccountNumber>INPUT YOUR INFORMATION</v15:AccountNumber>
                     <v15:Contact>
                        <v15:PersonName>SWAPNIL GHADAGE</v15:PersonName>
                        <v15:CompanyName>SYNTEL</v15:CompanyName>
                        <v15:PhoneNumber>9764859161</v15:PhoneNumber>
                        <v15:EMailAddress>SWAPNIL_GHADAGE@GMAIL.COM</v15:EMailAddress>
                     </v15:Contact>
                     <v15:Address>
                        <v15:StreetLines>BARAMATI</v15:StreetLines>
                        <v15:City>Memphis</v15:City>
                        <v15:StateOrProvinceCode>TN</v15:StateOrProvinceCode>
                        <v15:PostalCode>38017</v15:PostalCode>
                        <v15:CountryCode>US</v15:CountryCode>
                     </v15:Address>
                  </v15:ResponsibleParty>
               </v15:Payor>
            </v15:ShippingChargesPayment>
            
            <v15:CustomsClearanceDetail>
               <v15:DutiesPayment>
                  <v15:PaymentType>SENDER</v15:PaymentType>
                  <v15:Payor>
                     <v15:ResponsibleParty>
                        <v15:AccountNumber>150067600</v15:AccountNumber>
                        <v15:Contact>
                           <v15:PersonName>SWAPNIL GHADAGE</v15:PersonName>
                           <v15:CompanyName>SYNTEL</v15:CompanyName>
                           <v15:PhoneNumber>9764859161</v15:PhoneNumber>
                           <v15:EMailAddress>SWAPNIL_GHADAGE@GMAIL.COM</v15:EMailAddress>
                        </v15:Contact>
                        <v15:Address>
                           <v15:StreetLines>BARAMATI</v15:StreetLines>
                           <v15:City>Memphis</v15:City>
                           <v15:StateOrProvinceCode>TN</v15:StateOrProvinceCode>
                           <v15:PostalCode>38118</v15:PostalCode>
                           <v15:CountryCode>US</v15:CountryCode>
                        </v15:Address>
                     </v15:ResponsibleParty>
                  </v15:Payor>
               </v15:DutiesPayment>
               <v15:DocumentContent>DOCUMENTS_ONLY</v15:DocumentContent>
               <v15:CustomsValue>
                  <v15:Currency>USD</v15:Currency>
                  <v15:Amount>2500.000000</v15:Amount>
               </v15:CustomsValue>
               <v15:CommercialInvoice>
                  <v15:TermsOfSale>DAP</v15:TermsOfSale>
               </v15:CommercialInvoice>
               <v15:Commodities>
                  <v15:NumberOfPieces>1</v15:NumberOfPieces>
                  <v15:Description>sdf</v15:Description>
                  <v15:CountryOfManufacture>US</v15:CountryOfManufacture>
                  <v15:Weight>
                     <v15:Units>LB</v15:Units>
                     <v15:Value>20.22</v15:Value>
                  </v15:Weight>
                  <v15:Quantity>1</v15:Quantity>
                  <v15:QuantityUnits>cm</v15:QuantityUnits>
                  <v15:UnitPrice>
                     <v15:Currency>USD</v15:Currency>
                     <v15:Amount>45</v15:Amount>
                  </v15:UnitPrice>
                  <v15:CustomsValue>
                     <v15:Currency>USD</v15:Currency>
                     <v15:Amount>2500.000000</v15:Amount>
                  </v15:CustomsValue>
               </v15:Commodities>
            </v15:CustomsClearanceDetail>
            <v15:LabelSpecification>
               <v15:Dispositions>
                  <v15:DispositionType>STORED</v15:DispositionType>
               </v15:Dispositions>
               <v15:LabelFormatType>COMMON2D</v15:LabelFormatType>
               <v15:ImageType>PNG</v15:ImageType>
               <v15:LabelStockType>PAPER_4X6</v15:LabelStockType>
               <v15:LabelPrintingOrientation>TOP_EDGE_OF_TEXT_FIRST</v15:LabelPrintingOrientation>
            </v15:LabelSpecification>
            <v15:RateRequestTypes>LIST</v15:RateRequestTypes>
            <v15:PackageCount>5</v15:PackageCount>
            <v15:RequestedPackageLineItems>
               <v15:SequenceNumber>1</v15:SequenceNumber>
               <v15:Weight>
                  <v15:Units>LB</v15:Units>
                  <v15:Value>50</v15:Value>
               </v15:Weight>
               <v15:Dimensions>
                  <v15:Length>11</v15:Length>
                  <v15:Width>11</v15:Width>
                  <v15:Height>11</v15:Height>
                  <v15:Units>IN</v15:Units>
               </v15:Dimensions>
               <v15:PhysicalPackaging>BAG</v15:PhysicalPackaging>
               <v15:ItemDescription>BAG</v15:ItemDescription>
               <v15:ContentRecords>
                  <v15:PartNumber>1</v15:PartNumber>
                  <v15:ItemNumber>1</v15:ItemNumber>
                  <v15:ReceivedQuantity>1</v15:ReceivedQuantity>
                  <v15:Description>BAG</v15:Description>
               </v15:ContentRecords>
            </v15:RequestedPackageLineItems>
            <v15:RequestedPackageLineItems>
               <v15:SequenceNumber>2</v15:SequenceNumber>
               <v15:Weight>
                  <v15:Units>LB</v15:Units>
                  <v15:Value>50</v15:Value>
               </v15:Weight>
               <v15:Dimensions>
                  <v15:Length>11</v15:Length>
                  <v15:Width>11</v15:Width>
                  <v15:Height>11</v15:Height>
                  <v15:Units>IN</v15:Units>
               </v15:Dimensions>
               <v15:PhysicalPackaging>BAG</v15:PhysicalPackaging>
               <v15:ItemDescription>BAG</v15:ItemDescription>
               <v15:ContentRecords>
                  <v15:PartNumber>1</v15:PartNumber>
                  <v15:ItemNumber>1</v15:ItemNumber>
                  <v15:ReceivedQuantity>1</v15:ReceivedQuantity>
                  <v15:Description>BAG</v15:Description>
               </v15:ContentRecords>
            </v15:RequestedPackageLineItems>
            <v15:RequestedPackageLineItems>
               <v15:SequenceNumber>3</v15:SequenceNumber>
               <v15:Weight>
                  <v15:Units>LB</v15:Units>
                  <v15:Value>50</v15:Value>
               </v15:Weight>
               <v15:Dimensions>
                  <v15:Length>11</v15:Length>
                  <v15:Width>11</v15:Width>
                  <v15:Height>11</v15:Height>
                  <v15:Units>IN</v15:Units>
               </v15:Dimensions>
               <v15:PhysicalPackaging>BAG</v15:PhysicalPackaging>
               <v15:ItemDescription>BAG</v15:ItemDescription>
               <v15:ContentRecords>
                  <v15:PartNumber>1</v15:PartNumber>
                  <v15:ItemNumber>1</v15:ItemNumber>
                  <v15:ReceivedQuantity>1</v15:ReceivedQuantity>
                  <v15:Description>BAG</v15:Description>
               </v15:ContentRecords>
            </v15:RequestedPackageLineItems>
            <v15:RequestedPackageLineItems>
               <v15:SequenceNumber>4</v15:SequenceNumber>
               <v15:Weight>
                  <v15:Units>LB</v15:Units>
                  <v15:Value>50</v15:Value>
               </v15:Weight>
               <v15:Dimensions>
                  <v15:Length>11</v15:Length>
                  <v15:Width>11</v15:Width>
                  <v15:Height>11</v15:Height>
                  <v15:Units>IN</v15:Units>
               </v15:Dimensions>
               <v15:PhysicalPackaging>BAG</v15:PhysicalPackaging>
               <v15:ItemDescription>BAG</v15:ItemDescription>
               <v15:ContentRecords>
                  <v15:PartNumber>1</v15:PartNumber>
                  <v15:ItemNumber>1</v15:ItemNumber>
                  <v15:ReceivedQuantity>1</v15:ReceivedQuantity>
                  <v15:Description>BAG</v15:Description>
               </v15:ContentRecords>
            </v15:RequestedPackageLineItems>
            <v15:RequestedPackageLineItems>
               <v15:SequenceNumber>5</v15:SequenceNumber>
               <v15:Weight>
                  <v15:Units>LB</v15:Units>
                  <v15:Value>50</v15:Value>
               </v15:Weight>
               <v15:Dimensions>
                  <v15:Length>11</v15:Length>
                  <v15:Width>11</v15:Width>
                  <v15:Height>11</v15:Height>
                  <v15:Units>IN</v15:Units>
               </v15:Dimensions>
               <v15:PhysicalPackaging>BAG</v15:PhysicalPackaging>
               <v15:ItemDescription>BAG</v15:ItemDescription>
               <v15:ContentRecords>
                  <v15:PartNumber>1</v15:PartNumber>
                  <v15:ItemNumber>1</v15:ItemNumber>
                  <v15:ReceivedQuantity>1</v15:ReceivedQuantity>
                  <v15:Description>BAG</v15:Description>
               </v15:ContentRecords>
            </v15:RequestedPackageLineItems>
         </v15:RequestedShipment>
      </v15:CreateOpenShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>


Response:

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <CreateOpenShipmentReply xmlns="http://fedex.com/ws/openship/v15">
         <HighestSeverity>WARNING</HighestSeverity>
         <Notifications>
            <Severity>WARNING</Severity>
            <Source>ship</Source>
            <Code>2469</Code>
            <Message>shipTimestamp is invalid</Message>
            <LocalizedMessage>shipTimestamp is invalid</LocalizedMessage>
         </Notifications>
         <TransactionDetail>
            <CustomerTransactionId>CreateOpenShipmentRequest_v6</CustomerTransactionId>
            <Localization>
               <LanguageCode>EN</LanguageCode>
               <LocaleCode>en</LocaleCode>
            </Localization>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>15</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <JobId>307e28ad43201as014d0j291248</JobId>
         <AsynchronousProcessingResults>
            <Options>SYNCHRONOUSLY_PROCESSED</Options>
         </AsynchronousProcessingResults>
         <CompletedShipmentDetail>
            <UsDomestic>false</UsDomestic>
            <CarrierCode>FDXE</CarrierCode>
            <MasterTrackingId>
               <TrackingIdType>FEDEX</TrackingIdType>
               <FormId>0430</FormId>
               <TrackingNumber>794907332267</TrackingNumber>
            </MasterTrackingId>
            <CompletedPackageDetails>
               <SequenceNumber>1</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0430</FormId>
                  <TrackingNumber>794907332267</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
            <CompletedPackageDetails>
               <SequenceNumber>2</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0441</FormId>
                  <TrackingNumber>794907332278</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
            <CompletedPackageDetails>
               <SequenceNumber>3</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0441</FormId>
                  <TrackingNumber>794907332289</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
            <CompletedPackageDetails>
               <SequenceNumber>4</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0441</FormId>
                  <TrackingNumber>794907332290</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
            <CompletedPackageDetails>
               <SequenceNumber>5</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0441</FormId>
                  <TrackingNumber>794907332304</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
         </CompletedShipmentDetail>
         <Index>Key2408</Index>
      </CreateOpenShipmentReply>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


Additional Info:
URL:https://wsdrt.idev.fedex.com:443/web-services
Date:Wed Nov 29 11:27:22 IST 2017
TimeTaken:2214ms
